#---------------------------------------------------------#
# R in Action: Chapter 4                                  #
# requires that the reshape and sqldf packages have       #
# been installed                                          #
# install.packages(c('reshape', 'sqldf'))                 #
#---------------------------------------------------------#

# Listing 4.1 - Creating the leadership data frame
#===============================================================
#经理人    日期     国籍   性别	   年龄	   q1  q2  q3  q4  q5
#---------------------------------------------------------------
#	  1     10/24/08	 US 		M		    32 		 5 	 4 	 5 	 5 	 5
#	  2 	  10/28/08	 US 		F 		  45 		 3 	 5 	 2 	 5 	 5
#	  3 	  10/01/08	 UK 		F 		  25 		 3 	 5 	 5 	 5 	 2
#	  4 	  10/12/08	 UK 		M 		  39 		 3 	 3 	 4
#	  5 	  05/01/09	 UK 		F 		  99 		 2 	 2 	 1 	 2 	 1
#===============================================================
manager <- c(1, 2, 3, 4, 5)
date <- c("10/24/08", "10/28/08", "10/1/08", "10/12/08", 
          "5/1/09")
gender <- c("M", "F", "F", "M", "F")
age <- c(32, 45, 25, 39, 99)
q1 <- c(5, 3, 3, 3, 2)
q2 <- c(4, 5, 5, 3, 2)
q3 <- c(5, 2, 5, 4, 1)
q4 <- c(5, 5, 5, NA, 2)
q5 <- c(5, 5, 2, NA, 1)
leadership <- data.frame(manager, date, gender, age, 
    q1, q2, q3, q4, q5, stringsAsFactors = FALSE)